<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"08e166df0374d73276d573fbba7b0aecfd40c728dcdef42de297acdb8c1e719f","plan_job_ref":"Job plan #7 at https://github.com/GSA/usnotify-ssb/actions/runs/4235583529","plan_hash":"641996bb6c5b0bc11e6831342f822410d5836618bcf3270fe09b2458ffa6094a","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
      + username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-demo"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
      + url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
      + username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_spaces = [
      + "gsa-tts-benefits-studio-prototyping/notify-demo",
        "gsa-tts-benefits-studio-prototyping/notify-management-staging",
        # (2 unchanged elements hidden)
    ]
```
</details>

:x: Error applying plan in [apply #8](https://github.com/GSA/usnotify-ssb/actions/runs/4235865239)